Hi @olegmukhin, 
i Just tested `for_each` is working fine for me, please let me did i miss anything

```
# bigip_waf_policy.test-awaf-new["mytestpolicy2"] will be created
  + resource "bigip_waf_policy" "test-awaf-new" {
      + application_language = "utf-8"
      + case_insensitive     = false
      + description          = "Rapid Deployment-3"
      + enable_passivemode   = false
      + enforcement_mode     = "blocking"
      + id                   = (known after apply)
      + name                 = "mytestpolicy2"
      + partition            = "Common"
      + policy_export_json   = (known after apply)
      + policy_id            = (known after apply)
      + template_name        = "POLICY_TEMPLATE_API_SECURITY"
      + type                 = "security"
    }

  # bigip_waf_policy.test-awaf-new["mytestpolicy3"] will be created
  + resource "bigip_waf_policy" "test-awaf-new" {
      + application_language = "utf-8"
      + case_insensitive     = false
      + description          = "Rapid Deployment-4"
      + enable_passivemode   = false
      + enforcement_mode     = "blocking"
      + id                   = (known after apply)
      + name                 = "mytestpolicy3"
      + partition            = "Common"
      + policy_export_json   = (known after apply)
      + policy_id            = (known after apply)
      + template_name        = "POLICY_TEMPLATE_API_SECURITY"
      + type                 = "security"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

bigip_waf_policy.test-awaf-new["mytestpolicy2"]: Creating...
bigip_waf_policy.test-awaf-new["mytestpolicy3"]: Creating...
bigip_waf_policy.test-awaf-new["mytestpolicy3"]: Still creating... [10s elapsed]
bigip_waf_policy.test-awaf-new["mytestpolicy2"]: Still creating... [10s elapsed]
bigip_waf_policy.test-awaf-new["mytestpolicy2"]: Still creating... [20s elapsed]
bigip_waf_policy.test-awaf-new["mytestpolicy3"]: Still creating... [20s elapsed]
bigip_waf_policy.test-awaf-new["mytestpolicy3"]: Still creating... [30s elapsed]
bigip_waf_policy.test-awaf-new["mytestpolicy2"]: Still creating... [30s elapsed]
bigip_waf_policy.test-awaf-new["mytestpolicy2"]: Creation complete after 39s [id=8UXIlQDGd0Whv0ZJ3BsqeA]
bigip_waf_policy.test-awaf-new["mytestpolicy3"]: Still creating... [40s elapsed]
bigip_waf_policy.test-awaf-new["mytestpolicy3"]: Still creating... [50s elapsed]
bigip_waf_policy.test-awaf-new["mytestpolicy3"]: Creation complete after 57s [id=G2Vq3wOk-kBb3af5sTyE_g]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```